---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageId.EmptyObject
enum: Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId.EmptyObject

A warning level message. The conversion encountered an object with no data to convert. The object will be ignored. This may indicate a problem with incoming data.